dougrenaux/dr_Tiva_Template/Lab2/src/system_TM4C1294.c
/******************************************************************************
 * @file     system_TM4C1294.c (based on system_TM4C129.c)
 * @brief    CMSIS Device System Source File for
 *           TI TIVA TM4C129 Snowflake Device Series
 * @version  V1.00
 * @date     11. August 2019 (modified by Hugo Vieira Neto)
 ******************************************************************************/

#include <stdint.h>
#include "TM4C1294NCPDT.h"

/*----------------------------------------------------------------------------
  Defines taken from inc/hw_sysctl.h
 *----------------------------------------------------------------------------*/
#define SYSCTL_MEMTIM0_EBCHT_0_5                                              \
                                (0x00000000)  // 1/2 system clock period
#define SYSCTL_MEMTIM0_EBCHT_1_5                                              \
                                (0x00800000)  // 1.5 system clock periods
#define SYSCTL_MEMTIM0_EBCHT_2  (0x00C00000)  // 2 system clock periods
#define SYSCTL_MEMTIM0_EBCHT_2_5                                              \
                                (0x01000000)  // 2.5 system clock periods
#define SYSCTL_MEMTIM0_EBCHT_3  (0x01400000)  // 3 system clock periods
#define SYSCTL_MEMTIM0_EBCHT_3_5                                              \
                                (0x01800000)  // 3.5 system clock periods
#define SYSCTL_MEMTIM0_EBCE     (0x00200000)  // EEPROM Bank Clock Edge
#define SYSCTL_MEMTIM0_MB1      (0x00100010)  // Must be one
#define SYSCTL_MEMTIM0_FBCHT_0_5                                              \
                                (0x00000000)  // 1/2 system clock period
#define SYSCTL_MEMTIM0_FBCHT_1_5                                              \
                                (0x00000080)  // 1.5 system clock periods
#define SYSCTL_MEMTIM0_FBCHT_2  (0x000000C0)  // 2 system clock periods
#define SYSCTL_MEMTIM0_FBCHT_2_5                                              \
                                (0x00000100)  // 2.5 system clock periods
#define SYSCTL_MEMTIM0_FBCHT_3  (0x00000140)  // 3 system clock periods
#define SYSCTL_MEMTIM0_FBCHT_3_5                                              \
                                (0x00000180)  // 3.5 system clock periods
#define SYSCTL_MEMTIM0_FBCE     (0x00000020)  // Flash Bank Clock Edge
#define SYSCTL_MEMTIM0_FWS_M    (0x0000000F)  // Flash Wait State
#define SYSCTL_MEMTIM0_EWS_S    (16)
#define SYSCTL_MEMTIM0_FWS_S    (0)

#define SYSCTL_MOSCCTL_OSCRNG   (0x00000010)  // Oscillator Range
#define SYSCTL_MOSCCTL_PWRDN    (0x00000008)  // Power Down
#define SYSCTL_MOSCCTL_NOXTAL   (0x00000004)  // No Crystal Connected

#define SYSCTL_PLLFREQ0_PLLPWR  (0x00800000)  // PLL Power
#define SYSCTL_PLLFREQ0_MFRAC_M (0x000FFC00)  // PLL M Fractional Value
#define SYSCTL_PLLFREQ0_MINT_M  (0x000003FF)  // PLL M Integer Value
#define SYSCTL_PLLFREQ0_MFRAC_S (10)

#define SYSCTL_PLLFREQ1_Q_M     (0x00001F00)  // PLL Q Value
#define SYSCTL_PLLFREQ1_N_M     (0x0000001F)  // PLL N Value
#define SYSCTL_PLLFREQ1_Q_S     (8)
#define SYSCTL_PLLFREQ1_N_S     (0)

#define SYSCTL_PLLSTAT_LOCK     (0x00000001)  // PLL Lock

#define SYSCTL_RSCLKCFG_MEMTIMU (0x80000000)  // Memory Timing Register Update
#define SYSCTL_RSCLKCFG_NEWFREQ (0x40000000)  // New PLLFREQ Accept
#define SYSCTL_RSCLKCFG_USEPLL  (0x10000000)  // Use PLL
#define SYSCTL_RSCLKCFG_PLLSRC_M                                              \
                                (0x0F000000)  // PLL Source
#define SYSCTL_RSCLKCFG_PLLSRC_PIOSC                                          \
                                (0x00000000)  // PIOSC is PLL input clock source
#define SYSCTL_RSCLKCFG_PLLSRC_MOSC                                           \
                                (0x03000000)  // MOSC is the PLL input clock
                                            // source
#define SYSCTL_RSCLKCFG_OSCSRC_M                                              \
                                (0x00F00000)  // Oscillator Source
#define SYSCTL_RSCLKCFG_OSCSRC_PIOSC                                          \
                                (0x00000000)  // PIOSC is oscillator source
#define SYSCTL_RSCLKCFG_OSCSRC_LFIOSC                                         \
                                (0x00200000)  // LFIOSC is oscillator source
#define SYSCTL_RSCLKCFG_OSCSRC_MOSC                                           \
                                (0x00300000)  // MOSC is oscillator source
#define SYSCTL_RSCLKCFG_OSCSRC_RTC                                            \
                                (0x00400000)  // Hibernation Module RTC
                                              // Oscillator (RTCOSC)
#define SYSCTL_RSCLKCFG_PSYSDIV_M                                             \
                                (0x000003FF)  // PLL System Clock Divisor

#define SYSCTL_RIS_MOSCPUPRIS   (0x00000100)  // MOSC Power Up Raw Interrupt
                                              // Status
#define SYSCTL_RSCLKCFG_OSYSDIV_M                                             \
                                (0x000FFC00)  // Oscillator System Clock Divisor
#define SYSCTL_RSCLKCFG_PSYSDIV_M                                             \
                                (0x000003FF)  // PLL System Clock Divisor
#define SYSCTL_RSCLKCFG_OSYSDIV_S                                             \
                                (10)
#define SYSCTL_RSCLKCFG_PSYSDIV_S                                             \
                                (0)


/*----------------------------------------------------------------------------
  Defines taken from driverlib/sysctl.h
 *----------------------------------------------------------------------------*/
#define SYSCTL_CFG_VCO_480      (0xF1000000)  // VCO is 480 MHz
#define SYSCTL_CFG_VCO_320      (0xF0000000)  // VCO is 320 MHz
#define SYSCTL_OSC_MAIN         (0x00000000)  // Osc source is main osc
#define SYSCTL_OSC_INT          (0x00000010)  // Osc source is int. osc
#define SYSCTL_OSC_INT30        (0x00000030)  // Osc source is int. 30 kHz
#define SYSCTL_OSC_EXT32        (0x80000038)  // Osc source is ext. 32 kHz
#define SYSCTL_USE_PLL          (0x00000000)  // System clock is the PLL clock
#define SYSCTL_USE_OSC          (0x00003800)  // System clock is the osc clock
#define SYSCTL_XTAL_5MHZ        (0x00000240)  // External crystal is 5MHz
#define SYSCTL_XTAL_5_12MHZ     (0x00000280)  // External crystal is 5.12MHz
#define SYSCTL_XTAL_6MHZ        (0x000002C0)  // External crystal is 6MHz
#define SYSCTL_XTAL_6_14MHZ     (0x00000300)  // External crystal is 6.144MHz
#define SYSCTL_XTAL_7_37MHZ     (0x00000340)  // External crystal is 7.3728MHz
#define SYSCTL_XTAL_8MHZ        (0x00000380)  // External crystal is 8MHz
#define SYSCTL_XTAL_8_19MHZ     (0x000003C0)  // External crystal is 8.192MHz
#define SYSCTL_XTAL_10MHZ       (0x00000400)  // External crystal is 10 MHz
#define SYSCTL_XTAL_12MHZ       (0x00000440)  // External crystal is 12 MHz
#define SYSCTL_XTAL_12_2MHZ     (0x00000480)  // External crystal is 12.288 MHz
#define SYSCTL_XTAL_13_5MHZ     (0x000004C0)  // External crystal is 13.56 MHz
#define SYSCTL_XTAL_14_3MHZ     (0x00000500)  // External crystal is 14.31818 MHz
#define SYSCTL_XTAL_16MHZ       (0x00000540)  // External crystal is 16 MHz
#define SYSCTL_XTAL_16_3MHZ     (0x00000580)  // External crystal is 16.384 MHz
#define SYSCTL_XTAL_18MHZ       (0x000005C0)  // External crystal is 18.0 MHz
#define SYSCTL_XTAL_20MHZ       (0x00000600)  // External crystal is 20.0 MHz
#define SYSCTL_XTAL_24MHZ       (0x00000640)  // External crystal is 24.0 MHz
#define SYSCTL_XTAL_25MHZ       (0x00000680)  // External crystal is 25.0 MHz


/*----------------------------------------------------------------------------
  Defines for clock configuration -- user defined
 *----------------------------------------------------------------------------*/
#define __CONFIG_CLOCK                                                        \
    (SYSCTL_XTAL_25MHZ | SYSCTL_OSC_MAIN | SYSCTL_USE_PLL | SYSCTL_CFG_VCO_320)
//#define __SYSTEM_CLOCK    (120000000UL)
#define __SYSTEM_CLOCK    (5000000UL)        


/*----------------------------------------------------------------------------
  Defines taken from driverlib/sysctl.c
 *----------------------------------------------------------------------------*/
#define MAX_VCO_ENTRIES         2
#define MAX_XTAL_ENTRIES        18

/*----------------------------------------------------------------------------
  Macros taken from driverlib/sysctl.c
 *----------------------------------------------------------------------------*/
// Macro that converts the XTAL value to an index to the g_pui32Xtals array
#define SysCtlXtalCfgToIndex(a) ((a & 0x7c0) >> 6)
// Macros that make g_pui32XTALtoVCO table more readable
#define PLL_M_TO_REG(mi, mf)                                                  \
        ((uint32_t)mi | (uint32_t)(mf << SYSCTL_PLLFREQ0_MFRAC_S))
#define PLL_N_TO_REG(n)                                                       \
        ((uint32_t)(n - 1) << SYSCTL_PLLFREQ1_N_S)
#define PLL_Q_TO_REG(q)                                                       \
        ((uint32_t)(q - 1) << SYSCTL_PLLFREQ1_Q_S)


/*----------------------------------------------------------------------------
  Constants taken from driverlib/sysctl.c
 *----------------------------------------------------------------------------*/
// Array that maps the crystal number in RCC to a frequency
static const uint32_t g_pui32Xtals[] = { 1000000,  1843200,  2000000,
                                         2457600,  3579545,  3686400,
                                         4000000,  4096000,  4915200, 
                                         5000000,  5120000,  6000000,
                                         6144000,  7372800,  8000000,
                                         8192000, 10000000, 12000000,
                                        12288000, 13560000, 14318180,
                                        16000000, 16384000, 18000000,
                                        20000000, 24000000, 25000000
};

