dougrenaux/dr_Tiva_Template/Lab2/src/system_TM4C1294.c
  #if defined (__FPU_USED) && (__FPU_USED == 1U)
    SCB->CPACR |= ((3UL << 10*2) |  // enable CP10 Full Access
                   (3UL << 11*2));  // enable CP11 Full Access
  #endif

  #ifdef UNALIGNED_SUPPORT_DISABLE
    SCB->CCR |= SCB_CCR_UNALIGN_TRP_Msk;
  #endif

  // Clock configuration adapted from driverlib/sysctl.c
  // SysCtlClockFreqSet with CMSIS-Core style register access
  SystemCoreClock = 0;
  
  // Get the index of the crystal
  int32_t i32XtalIdx = SysCtlXtalCfgToIndex(__CONFIG_CLOCK);

  // Determine which non-PLL source was selected
  uint32_t ui32Osc, ui32OscSelect;
  uint32_t ui32MOSCCTL;
  
  if((__CONFIG_CLOCK & 0x38) == SYSCTL_OSC_INT){
    // Use the nominal frequency for the PIOSC oscillator
    ui32Osc = 16000000;
    ui32OscSelect = SYSCTL_RSCLKCFG_OSCSRC_PIOSC | SYSCTL_RSCLKCFG_PLLSRC_PIOSC;
    // Force the crystal index to 16 MHz
    i32XtalIdx = SysCtlXtalCfgToIndex(SYSCTL_XTAL_16MHZ);
  } // if
  
  else if((__CONFIG_CLOCK & 0x38) == SYSCTL_OSC_INT30){
    // Use the nominal frequency for the low frequency oscillator
    ui32Osc = 30000;
    ui32OscSelect = SYSCTL_RSCLKCFG_OSCSRC_LFIOSC;
  } // else if
  
  else if((__CONFIG_CLOCK & 0x38) == (SYSCTL_OSC_EXT32 & 0x38)){
    // Use the RTC frequency
    ui32Osc = 32768;
    ui32OscSelect = SYSCTL_RSCLKCFG_OSCSRC_RTC;
  } // else if
  
  else if((__CONFIG_CLOCK & 0x38) == SYSCTL_OSC_MAIN){
    // Bounds check the source frequency for the main oscillator
    // The PLL tables in the g_pppui32XTALtoVCO structure range from 5 to 25MHz
    if((i32XtalIdx > (SysCtlXtalCfgToIndex(SYSCTL_XTAL_25MHZ))) ||
       (i32XtalIdx < (SysCtlXtalCfgToIndex(SYSCTL_XTAL_5MHZ))))
      return;

    ui32Osc = g_pui32Xtals[i32XtalIdx];
    // Set the PLL source select to MOSC
    ui32OscSelect = SYSCTL_RSCLKCFG_OSCSRC_MOSC | SYSCTL_RSCLKCFG_PLLSRC_MOSC;

    // Clear MOSC power down, high oscillator range setting, and no crystal
    // present setting
    ui32MOSCCTL = SYSCTL->MOSCCTL & ~(SYSCTL_MOSCCTL_OSCRNG |
                  SYSCTL_MOSCCTL_PWRDN | SYSCTL_MOSCCTL_NOXTAL);
    // Increase the drive strength for MOSC of 10 MHz and above
    if(i32XtalIdx >= (SysCtlXtalCfgToIndex(SYSCTL_XTAL_10MHZ) -
                     (SysCtlXtalCfgToIndex(SYSCTL_XTAL_5MHZ))))
      ui32MOSCCTL |= SYSCTL_MOSCCTL_OSCRNG;
    SYSCTL->MOSCCTL = ui32MOSCCTL;
    
    // Timeout using the legacy delay value
    uint32_t ui32Delay = 524288;
    while((SYSCTL->RIS & SYSCTL_RIS_MOSCPUPRIS) == 0){
      ui32Delay--;
      if(ui32Delay == 0)
          break;
     } // while

    // If the main oscillator failed to start up then return
    if(ui32Delay == 0)
      return;
  } // else if
  
  else{
    // Invalid request because no oscillator source was indicated
    ui32Osc = 0;
    ui32OscSelect = SYSCTL_RSCLKCFG_OSCSRC_PIOSC;
  } // else
  
  uint32_t ui32RSClkConfig, ui32SysDiv;
  // Check if the running with the PLL enabled was requested
  if((__CONFIG_CLOCK & SYSCTL_USE_OSC) == SYSCTL_USE_PLL){
    // __CONFIG_CLOCK must be SYSCTL_OSC_MAIN or SYSCTL_OSC_INT
    if(((__CONFIG_CLOCK & 0x38) != SYSCTL_OSC_MAIN) &&
       ((__CONFIG_CLOCK & 0x38) != SYSCTL_OSC_INT))
      return;
    
    // Get the VCO index out of the __CONFIG_CLOCK parameter
    int32_t i32VCOIdx = (__CONFIG_CLOCK >> 24) & 0x7;

//    // Check if the VCO index is not out of bounds
//    if(i32VCOIdx >= MAX_VCO_ENTRIES)
//      while(1); // error!
    
    // Set the memory timings for the maximum external frequency since
    // this could be a switch to PIOSC or possibly to MOSC which can be
    // up to 25MHz
    SYSCTL->MEMTIM0 = _SysCtlMemTimingGet(25000000);

    // Clear the old PLL divider and source in case it was set
    ui32RSClkConfig = SYSCTL->RSCLKCFG & ~(SYSCTL_RSCLKCFG_PSYSDIV_M |
                      SYSCTL_RSCLKCFG_OSCSRC_M | SYSCTL_RSCLKCFG_PLLSRC_M |
                      SYSCTL_RSCLKCFG_USEPLL);
    // Update the memory timings to match running from PIOSC
    ui32RSClkConfig |= SYSCTL_RSCLKCFG_MEMTIMU;
    // Update clock configuration to switch back to PIOSC
    SYSCTL->RSCLKCFG = ui32RSClkConfig;

    // The table starts at 5 MHz so modify the index to match this
    i32XtalIdx -= SysCtlXtalCfgToIndex(SYSCTL_XTAL_5MHZ);

    // Calculate the System divider for the closest frequency to the requested
    ui32SysDiv = (g_pui32VCOFrequencies[i32VCOIdx] + __SYSTEM_CLOCK - 1) /
                  __SYSTEM_CLOCK;

    // Set the oscillator source
    SYSCTL->RSCLKCFG |= ui32OscSelect;

    // Set the M, N and Q values provided from the table and preserve
    // the power state of the main PLL
    SYSCTL->PLLFREQ1  = g_pppui32XTALtoVCO[i32VCOIdx][i32XtalIdx][1];
    SYSCTL->PLLFREQ1 |= PLL_Q_TO_REG(ui32SysDiv);
    SYSCTL->PLLFREQ0  = (g_pppui32XTALtoVCO[i32VCOIdx][i32XtalIdx][0] |
                       (SYSCTL->PLLFREQ0 & SYSCTL_PLLFREQ0_PLLPWR));

    // Calculate the actual system clock
    SystemCoreClock = _SysCtlFrequencyGet(ui32Osc);

    // Set the Flash and EEPROM timing values
    SYSCTL->MEMTIM0 = _SysCtlMemTimingGet(SystemCoreClock);

    // Check if the PLL is already powered up
    if(SYSCTL->PLLFREQ0 & SYSCTL_PLLFREQ0_PLLPWR)
      SYSCTL->RSCLKCFG |= SYSCTL_RSCLKCFG_NEWFREQ; // Trigger the PLL
    else
      SYSCTL->PLLFREQ0 |= SYSCTL_PLLFREQ0_PLLPWR; // Power up the PLL

    // Wait until the PLL has locked
    int32_t i32Timeout; 
    for(i32Timeout = 32768; i32Timeout > 0; i32Timeout--)
      if((SYSCTL->PLLSTAT & SYSCTL_PLLSTAT_LOCK))
        break;

    // If the loop above did not timeout then switch over to the PLL
    if(i32Timeout){
      ui32RSClkConfig = SYSCTL->RSCLKCFG |
                        (1 << SYSCTL_RSCLKCFG_PSYSDIV_S) | ui32OscSelect |
                        SYSCTL_RSCLKCFG_USEPLL | SYSCTL_RSCLKCFG_MEMTIMU;
      // Set the new clock configuration.
      SYSCTL->RSCLKCFG = ui32RSClkConfig;
    }
  } // if
  
  else{
    // Set the Flash and EEPROM timing values for PIOSC
    SYSCTL->MEMTIM0 = _SysCtlMemTimingGet(16000000);
    // Make sure that the PLL is powered down since it is not being used
    SYSCTL->PLLFREQ0 &= ~SYSCTL_PLLFREQ0_PLLPWR;
    // Clear the old PLL divider and source in case it was set
    ui32RSClkConfig = SYSCTL->RSCLKCFG & ~(SYSCTL_RSCLKCFG_OSYSDIV_M |
                      SYSCTL_RSCLKCFG_OSCSRC_M | SYSCTL_RSCLKCFG_USEPLL);
    // Update the memory timings
    ui32RSClkConfig |= SYSCTL_RSCLKCFG_MEMTIMU;
    // Set the new clock configuration
    SYSCTL->RSCLKCFG = ui32RSClkConfig;
    
    // If zero given as the system clock then default to divide by 1
    if(__SYSTEM_CLOCK == 0)
      ui32SysDiv = 0;
    else{
      // Calculate the System divider based on the requested
      // frequency
      ui32SysDiv = ui32Osc / __SYSTEM_CLOCK;
      // If the system divisor is not already zero, subtract one to
      // set the value in the register which requires the value to
      // be n-1
      if(!ui32SysDiv)
        ui32SysDiv -= 1;
      // Calculate the system clock
      SystemCoreClock = ui32Osc / (ui32SysDiv + 1);
    } // else

    // Set the memory timing values for the new system clock
    SYSCTL->MEMTIM0 = _SysCtlMemTimingGet(SystemCoreClock);
    // Set the new system clock values and update the memory timings
    ui32RSClkConfig = SYSCTL->RSCLKCFG |
                      (ui32SysDiv << SYSCTL_RSCLKCFG_OSYSDIV_S) |
                       ui32OscSelect | SYSCTL_RSCLKCFG_MEMTIMU;
    // Set the new clock configuration
    SYSCTL->RSCLKCFG = ui32RSClkConfig;
  } // else
  
  // Finally change the OSCSRC back to PIOSC
  SYSCTL->RSCLKCFG &= ~(SYSCTL_RSCLKCFG_OSCSRC_M);
} // SystemInit
